'''
Текстовый файл состоит не более чем из 1 200 000 символов X, Y, и Z. 
Определите максимальное количество идущих подряд символов, среди которых нет подстроки XZZY.  
'''

s = open("24.txt").replace()
s = s.replace("KEGE", "KEG EGE")
print(max(len(c) for c in s.split()))
