'''
В файле содержится последовательность целых чисел. 
Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. 
Определите количество пар чисел, в которых хотя бы один из двух элементов больше, 
чем наибольшее из всех чисел в файле, делящихся на 19. В ответе запишите два числа: 
сначала количество найденных пар, а затем – минимальную сумму элементов таких пар. 
В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
'''

a = [int(x) for x in open("17.txt")]
ans = []
mx19 = max(x for x in a if x % 19 == 0)
for i in range(len(a) - 1):
    if (a[i] > mx19) + (a[i + 1] > mx19) >= 1:
        ans.append(a[i] + a[i + 1])
print(len(ans), min(ans))
